// task 1

// let value = prompt("Введите что нибудь");
// let result = [];

// for(let i = 0; i < value.length; i++){
//     if(value[i] == value[value.length-i-1]){
//         result.push('1')
//     }else{
//         result.push('2')
//     }
// }
// if(result.includes('2')){
//     console.log('not a palindrome')
// }else{
//     console.log('palindrome')
// }







// task 2

// let value1 = prompt("Введите первое значение");
// let value2 = prompt("Введите второе значение");

// let str1 = value1.split("").sort().join("");
// let str2 = value2.split("").sort().join("");

// if(str1 == str2){
//     console.log("анаграммa");
// }else{
//     console.log(2);
// }







// task 3

// ПИТАННЯ НЕ ПРИДУМУВАВ, ТАК ЯК НЕ БАЧУ В ЦЬОМУ СЕНСУ, І ЦЕ НЕ ТАК ВАЖЛИВО


// let answers = ['а', 'б', 'в', 'а', 'а', 'б', 'а', 'в', 'б', 'в', 'б', 'б', 'а', 'б', 'а'];
// let earned = ['500','1000','2000','3000','5000','8000','10000','13000','15000','25000','50000','100000','250000',
// '500000','1000000'];
// let ask;
// let check;
// let counter;

// let questions = [
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765", 
//     "Cколько будет 22 + 49? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 27 + 93? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 27 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765",
//     "Cколько будет 227 + 493? \n" + "а) 770 \n" + "б) 760 \n" +"в) 775 \n" +"г) 765"
// ];

// for(let i = 0; i < questions.length; i++){
//     ask = prompt(questions[i]);
//     if(ask === answers[i]){
//         counter = earned[i];
//         if(Number(counter) == 1000000){
//             alert("Вы ответили на все вопросы. Ваш выиграш составляет 1000000")
//         }
//         check = confirm("Продоложаем игру?");
//         if(check == false){
//             alert("Вы выиграли " + counter);
//             break;
//         }
//     }else{
//         alert("Игра закончена, вы ответили не правильно");
//         if(Number(counter) < 5000){
//             alert("Вы выиграли 0");
//         }else if(Number(counter) > 5000 && Number(counter) < 25000){
//             alert("Вы выиграли 5000");
//         }else if(Number(counter) > 25000 && Number(counter) < 1000000){
//             alert("Вы выиграли 25000");
//         }
//         break;
//     }
// }